blog/tutorial-to-fail.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Tutorial to fail</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content">
<h1 class="title">Tutorial to fail</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org329deb9">Moral blinder</a>
<ul>
<li><a href="#org74e4a58">Example Scene</a>
<ul>
<li><a href="#org7b38f02">2021-11-04 Solution session.</a></li>
</ul>
</li>
<li><a href="#org97381b6">Solution</a>
<ul>
<li><a href="#org6d370b4">Change Reality/Moral standard</a></li>
<li><a href="#orgf12da56">Stated principle</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
This tutorial is a continuous process journaling on failures I encountered personally, my reflections on them, and my strategies to/not to get over them. Some of them might even don't have existing proved way to get over.
</p>

<p>
You can use this tutorial as a checklist, to see if you have the same cause of failure I do/did.
</p>

<p>
You can also experiment my strategies to see if they work for you.
</p>

<p>
If you do, or have similar strategies, or have similar problems which you treat with different strategies, I'd be more than pleased to recieve mails about them. 
</p>
<div id="outline-container-org329deb9" class="outline-2">
<h2 id="org329deb9">Moral blinder</h2>
<div class="outline-text-2" id="text-org329deb9">
<p>
I have characteristics which are considered immoral by tradition implicitly. With my common sence converging to local traditions, acknowledging them brings about sense of humiliation, stronger when the judge is someone else.
</p>

<p>
Therefore, I implicitly choose not to acknowledge them, which resulted in low self-esteem and strong identity needs from outside. Low self-esteem for I know my immorality, identity need for I need someone else telling me that I'm good to cover my immorality.
</p>

<p>
With such blinder, I can't understand reality very well, but only traditionally ideal senario local culture and I set for myself. This leads to many unwise decision.
</p>

<p>
Such decision take place mostly in improvisation, with no consciousness of stated principles and strategies, and my natural default beliefs are like, "I'm a genius", "I'm almighty", "I'll control everything." such.
</p>
</div>
<div id="outline-container-org74e4a58" class="outline-3">
<h3 id="org74e4a58">Example Scene</h3>
<div class="outline-text-3" id="text-org74e4a58">
</div>
<div id="outline-container-org7b38f02" class="outline-4">
<h4 id="org7b38f02">2021-11-04 Solution session.</h4>
<div class="outline-text-4" id="text-org7b38f02">
<p>
It was a session conducting solution list from privious work of 5 step process. The work in that session is translating a long list of Machine modifications into TODO tasks.
</p>

<p>
By default, I assume that I will be patient and quick about it, while completely focused and always clear with tons of knowledge and idea of how things should be done. I set a time limit of 30 minutes.
</p>

<p>
By reality, my patient fades very quick, and there's no proof my speed in this tasks, as I'm doing it the first time. My focus could be distracted and actually is distracted by LOL. My knowledge is limited, so are my ideas on how things should be done, so is not for my time. I spent more than 2 hour on the list, without finishing it, and the last few items are very brief, in great contrast of my plan in machine modification.
</p>

<p>
I ended up exhausted, with a not so good TODO list, and began to resist this whole idea of executing neither my solutions nor the 5 step process, because it seems unpleasent for me and was revealing my weaknesses.
</p>
</div>
</div>
</div>
<div id="outline-container-org97381b6" class="outline-3">
<h3 id="org97381b6">Solution</h3>
<div class="outline-text-3" id="text-org97381b6">
<p>
In emacs, when default behavior became not prefered, the default value of variable could be changed, or the variable could be given new value on startup or other conditions.
</p>

<p>
In the <a href="#org329deb9">Moral blinder</a> situation, if the beliefs used in decision making could be seen as variables, similar approach could be applied: Change Reality/Moral standard, or use stated principle before every session.
</p>
</div>
<div id="outline-container-org6d370b4" class="outline-4">
<h4 id="org6d370b4">Change Reality/Moral standard</h4>
<div class="outline-text-4" id="text-org6d370b4">
<p>
On one thing humans behave different than emacs: the variable doesn't change immediately after you wrote that you change it.
</p>

<p>
You could wrote a whole scheme of changing the reality-your nature or your condition-but the change won't come immediately after you worte the scheme, nor during the scheme, nor even after the scheme was finished. You may need to modify your scheme, or have a bunch of schemes to have a reality or moral standard changed.
</p>

<p>
The change of reality or moral standard, everything have anything to do with human, comes slower and in a continuous manner.
</p>

<p>
I maybe could prove this using some "pool of decision selection based on memory xyz" theories with neuralscience skills. I'll leave the area blank till then.  
</p>
</div>
</div>
<div id="outline-container-orgf12da56" class="outline-4">
<h4 id="orgf12da56">Stated principle</h4>
<div class="outline-text-4" id="text-orgf12da56">
<p>
While the default nature is hard to alter, human can easily follow clear stated principle/strategy/guideline in a short session.
</p>

<p>
The usage of stated principle is simple:
</p>
<ol class="org-ol">
<li>have lists of principle/strategy/guideline for differen tasks.</li>
<li>Before doing a particular type of tasks, state the principle/strategy/guidelines, and refer to it when doing things.</li>
</ol>

<p>
Variables could be taken in to consideration are:
</p>
<ul class="org-ul">
<li>Length of list
if too long, stating principle could be too time consuming and therefore ineffient.
if too short, the principles could be not enough to do the work, and therefore ineffective.
<ul class="org-ul">
<li>Could apply priority
the most important principle/strategy/guidelines get stated, and others just a skim</li>
<li>Could apply spaced exposure
cycle the stated principle/strategy/guidelines to make them more natural in certain scenario</li>
</ul></li>
<li>Length of session
stated principles get forgotten after a period of time.
The length of session should be long enough to do the work and short enough for people to keep counscious for the stated principles and memory of them.</li>
</ul>

<p>
Moreover, stated principles alter people's behavior in sessions, therefore could act as a way to gradually alter people's nature in <a href="#org6d370b4">Change Reality/Moral standard</a>
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="https://orgmode.org">Org</a> mode 9.3)</p>
</div>
</body>
</html>
